1、 ctrl + insert 复制 （选中文本）

2、 shift + insert 粘贴 

3、 cp 复制命令 如下

    cp /data/www/basic/apixfb.xiaohe.com/lts/core/Config/database_shengchan.php ./database.php 

       复制路径下的文件                                                          复制到哪里以及名字


===================================================================================================

文件权限

1、给指定的文件夹授权 chmod 777 files
                            权限值 文件夹名称
                      chmod -R 777 files 递归授权，当前文件夹及以下所有文件将爱都授权


===================================================================================================

切换用户 

1、切换到超级管理员 sudo su

2、终止超级管理员 exit